app/Controllers/User.php

    public function Status()
    {
        $sesi = user()->id;
        $data['title'] = 'status lamaran';
        $db      = \Config\Database::connect();
        $builder = $db->table('lamaran');
        $builder->select('*');
        $builder->where('iduser', $sesi);
        $query = $builder->get();
---
SELECT *
FROM `lamaran`
WHERE `iduser` = '4'